#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/gamersnote/gamersnote/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/gamersnote/gamersnote

To view this run in a browser, visit:
https://app.terraform.io/app/happyfukumoto/gamersnote/runs/run-T4fdXYrQDtSk6zQ5

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:455000526485:service/gamersnote/gamersnote]
module.ecr.aws_ecr_repository.app: Refreshing state... [id=gamersnote-app]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:455000526485:cluster/gamersnote]
module.vpc.module.aws_vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e81ff7ec6af5af90]
module.vpc.module.aws_vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b912a34575a4253a]
module.ecr.aws_ecr_repository.api: Refreshing state... [id=gamersnote-api]
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ap-northeast-1:455000526485:certificate/00a8ad21-ff76-4da4-845e-df28678f7b2b]
module.ecs.aws_ecs_task_definition.api: Refreshing state... [id=gamersnote-api]
module.acm.aws_route53_record.this["gamersnote.com"]: Refreshing state... [id=Z05181772U0208ZLB3AL8__8206226daa44e7e47b445ae8273d8106.gamersnote.com._CNAME]
module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2020-12-18 12:55:48 +0000 UTC]
module.vpc.module.aws_vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-086a526a8e2940105]
module.vpc.module.aws_vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03d35f9d7f8e1d1b1]
module.vpc.module.aws_vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-007848b304bba0120]
module.vpc.module.aws_vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0038bf597d7fa3342]
module.vpc.module.aws_vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0999cbab79b0169de]
module.vpc.module.aws_vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01901d747fa38dd39]
module.ecs.aws_security_group.this: Refreshing state... [id=sg-05f0ddf40cf30e7c3]
module.vpc.module.aws_vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07153c3f6cb0fcc1f]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-00a0a573a96120ec3]
module.vpc.module.aws_vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01901d747fa38dd391080289494]
module.vpc.module.aws_vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0455706d64301bbcf]
module.vpc.module.aws_vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-037f7097ace0bc71b]
module.vpc.module.aws_vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06d189796c3405612]
module.vpc.module.aws_vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cd0e858ac8458eb4]
module.vpc.module.aws_vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0eb1a678d2b5eae2d]
module.alb.module.aws_alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:loadbalancer/app/gamersnote-alb/d9ddc26d4c0823a6]
module.vpc.module.aws_vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07153c3f6cb0fcc1f1080289494]
module.alb.module.aws_alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:targetgroup/gn-20201218125837691800000002/94da241c0ea57274]
module.alb.aws_route53_record.this: Refreshing state... [id=Z05181772U0208ZLB3AL8_gamersnote.com_A]
module.alb.module.aws_alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/3e2ab12ba64b7f72]
module.alb.module.aws_alb.aws_lb_listener.frontend_https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/b8a513befb65e349]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + cluster                            = "gamersnote"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "gamersnote-api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "api"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:targetgroup/gn-20201218125837691800000002/94da241c0ea57274"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-05f0ddf40cf30e7c3",
            ]
          + subnets          = [
              + "subnet-007848b304bba0120",
            ]
        }
    }

  # module.ecs.aws_ecs_service.main will be destroyed
  - resource "aws_ecs_service" "main" {
      - cluster                            = "gamersnote" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "aws-service-role" -> null
      - id                                 = "arn:aws:ecs:ap-northeast-1:455000526485:service/gamersnote/gamersnote" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "gamersnote" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - task_definition                    = "arn:aws:ecs:ap-northeast-1:455000526485:task-definition/gamersnote-api:2" -> null
      - wait_for_steady_state              = false -> null

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "api" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:targetgroup/gn-20201218125837691800000002/94da241c0ea57274" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-05f0ddf40cf30e7c3",
            ] -> null
          - subnets          = [
              - "subnet-007848b304bba0120",
            ] -> null
        }
    }

  # module.ecs.aws_ecs_task_definition.api must be replaced
-/+ resource "aws_ecs_task_definition" "api" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:455000526485:task-definition/gamersnote-api:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu          = 0 -> null
                  - environment  = [] -> null
                  - essential    = true -> null
                  - mountPoints  = [] -> null
                  ~ portMappings = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom  = [] -> null
                    # (3 unchanged elements hidden)
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::455000526485:role/ecsTaskExecutionRole" -> (known after apply) # forces replacement
      ~ id                       = "gamersnote-api" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ task_role_arn            = "arn:aws:iam::455000526485:role/ecsTaskExecutionRole" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_ex_role will be created
  + resource "aws_iam_role" "ecs_task_ex_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_task_ex_role"
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "gamersnote-ecs-task-ex-role"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_task_role"
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "gamersnote-ecs-task-role"
        }
      + unique_id             = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
</details>
*Pusher: @happyfukumoto, Action: `pull_request`*